konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/usb_device_dpram.inc
#
# Derived from Raspberry Pi Pico SDK
#
# Copyright (c) 2024 Raspberry Pi Ltd.
#
# Redistribution and use permitted under BSD 3-Clause terms.
# See full license in THIRD_PARTY_LICENSES/PICO_SDK_LICENSE.txt
#
# =============================================================================
# Register block : USB_DEVICE_DPRAM
# Version        : 1
# Bus type       : ahbl
# Description    : DPRAM layout for USB device.
# =============================================================================
.ifndef	_HARDWARE_REGS_USB_DEVICE_DPRAM_H
.set	_HARDWARE_REGS_USB_DEVICE_DPRAM_H, 1
# =============================================================================
# Register    : USB_DEVICE_DPRAM_SETUP_PACKET_LOW
# Description : Bytes 0-3 of the SETUP packet from the host.
.equ	USB_DEVICE_DPRAM_SETUP_PACKET_LOW_OFFSET, 0x00000000
.equ	USB_DEVICE_DPRAM_SETUP_PACKET_LOW_BITS, 0xffffffff
.equ	USB_DEVICE_DPRAM_SETUP_PACKET_LOW_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_SETUP_PACKET_LOW_WVALUE
.equ	USB_DEVICE_DPRAM_SETUP_PACKET_LOW_WVALUE_RESET, 0x0000
.equ	USB_DEVICE_DPRAM_SETUP_PACKET_LOW_WVALUE_BITS, 0xffff0000
.equ	USB_DEVICE_DPRAM_SETUP_PACKET_LOW_WVALUE_MSB, 31
.equ	USB_DEVICE_DPRAM_SETUP_PACKET_LOW_WVALUE_LSB, 16
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_SETUP_PACKET_LOW_BREQUEST
.equ	USB_DEVICE_DPRAM_SETUP_PACKET_LOW_BREQUEST_RESET, 0x00
.equ	USB_DEVICE_DPRAM_SETUP_PACKET_LOW_BREQUEST_BITS, 0x0000ff00
.equ	USB_DEVICE_DPRAM_SETUP_PACKET_LOW_BREQUEST_MSB, 15
.equ	USB_DEVICE_DPRAM_SETUP_PACKET_LOW_BREQUEST_LSB, 8
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_SETUP_PACKET_LOW_BMREQUESTTYPE
.equ	USB_DEVICE_DPRAM_SETUP_PACKET_LOW_BMREQUESTTYPE_RESET, 0x00
.equ	USB_DEVICE_DPRAM_SETUP_PACKET_LOW_BMREQUESTTYPE_BITS, 0x000000ff
.equ	USB_DEVICE_DPRAM_SETUP_PACKET_LOW_BMREQUESTTYPE_MSB, 7
.equ	USB_DEVICE_DPRAM_SETUP_PACKET_LOW_BMREQUESTTYPE_LSB, 0
# =============================================================================
# Register    : USB_DEVICE_DPRAM_SETUP_PACKET_HIGH
# Description : Bytes 4-7 of the setup packet from the host.
.equ	USB_DEVICE_DPRAM_SETUP_PACKET_HIGH_OFFSET, 0x00000004
.equ	USB_DEVICE_DPRAM_SETUP_PACKET_HIGH_BITS, 0xffffffff
.equ	USB_DEVICE_DPRAM_SETUP_PACKET_HIGH_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_SETUP_PACKET_HIGH_WLENGTH
.equ	USB_DEVICE_DPRAM_SETUP_PACKET_HIGH_WLENGTH_RESET, 0x0000
.equ	USB_DEVICE_DPRAM_SETUP_PACKET_HIGH_WLENGTH_BITS, 0xffff0000
.equ	USB_DEVICE_DPRAM_SETUP_PACKET_HIGH_WLENGTH_MSB, 31
.equ	USB_DEVICE_DPRAM_SETUP_PACKET_HIGH_WLENGTH_LSB, 16
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_SETUP_PACKET_HIGH_WINDEX
.equ	USB_DEVICE_DPRAM_SETUP_PACKET_HIGH_WINDEX_RESET, 0x0000
.equ	USB_DEVICE_DPRAM_SETUP_PACKET_HIGH_WINDEX_BITS, 0x0000ffff
.equ	USB_DEVICE_DPRAM_SETUP_PACKET_HIGH_WINDEX_MSB, 15
.equ	USB_DEVICE_DPRAM_SETUP_PACKET_HIGH_WINDEX_LSB, 0
# =============================================================================
# Register    : USB_DEVICE_DPRAM_EP1_IN_CONTROL
.equ	USB_DEVICE_DPRAM_EP1_IN_CONTROL_OFFSET, 0x00000008
.equ	USB_DEVICE_DPRAM_EP1_IN_CONTROL_BITS, 0xfc03ffff
.equ	USB_DEVICE_DPRAM_EP1_IN_CONTROL_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP1_IN_CONTROL_ENABLE
# Description : Enable this endpoint. The device will not reply to any packets
#               for this endpoint if this bit is not set.
.equ	USB_DEVICE_DPRAM_EP1_IN_CONTROL_ENABLE_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP1_IN_CONTROL_ENABLE_BITS, 0x80000000
.equ	USB_DEVICE_DPRAM_EP1_IN_CONTROL_ENABLE_MSB, 31
.equ	USB_DEVICE_DPRAM_EP1_IN_CONTROL_ENABLE_LSB, 31
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP1_IN_CONTROL_DOUBLE_BUFFERED
# Description : This endpoint is double buffered.
.equ	USB_DEVICE_DPRAM_EP1_IN_CONTROL_DOUBLE_BUFFERED_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP1_IN_CONTROL_DOUBLE_BUFFERED_BITS, 0x40000000
.equ	USB_DEVICE_DPRAM_EP1_IN_CONTROL_DOUBLE_BUFFERED_MSB, 30
.equ	USB_DEVICE_DPRAM_EP1_IN_CONTROL_DOUBLE_BUFFERED_LSB, 30
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP1_IN_CONTROL_INTERRUPT_PER_BUFF
# Description : Trigger an interrupt each time a buffer is done.
.equ	USB_DEVICE_DPRAM_EP1_IN_CONTROL_INTERRUPT_PER_BUFF_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP1_IN_CONTROL_INTERRUPT_PER_BUFF_BITS, 0x20000000
.equ	USB_DEVICE_DPRAM_EP1_IN_CONTROL_INTERRUPT_PER_BUFF_MSB, 29
.equ	USB_DEVICE_DPRAM_EP1_IN_CONTROL_INTERRUPT_PER_BUFF_LSB, 29
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP1_IN_CONTROL_INTERRUPT_PER_DOUBLE_BUFF
# Description : Trigger an interrupt each time both buffers are done. Only
#               valid in double buffered mode.
.equ	USB_DEVICE_DPRAM_EP1_IN_CONTROL_INTERRUPT_PER_DOUBLE_BUFF_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP1_IN_CONTROL_INTERRUPT_PER_DOUBLE_BUFF_BITS, 0x10000000
.equ	USB_DEVICE_DPRAM_EP1_IN_CONTROL_INTERRUPT_PER_DOUBLE_BUFF_MSB, 28
.equ	USB_DEVICE_DPRAM_EP1_IN_CONTROL_INTERRUPT_PER_DOUBLE_BUFF_LSB, 28
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP1_IN_CONTROL_ENDPOINT_TYPE
#               0x0 -> Control
#               0x1 -> Isochronous
#               0x2 -> Bulk
#               0x3 -> Interrupt
.equ	USB_DEVICE_DPRAM_EP1_IN_CONTROL_ENDPOINT_TYPE_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP1_IN_CONTROL_ENDPOINT_TYPE_BITS, 0x0c000000
.equ	USB_DEVICE_DPRAM_EP1_IN_CONTROL_ENDPOINT_TYPE_MSB, 27
.equ	USB_DEVICE_DPRAM_EP1_IN_CONTROL_ENDPOINT_TYPE_LSB, 26
.equ	USB_DEVICE_DPRAM_EP1_IN_CONTROL_ENDPOINT_TYPE_VALUE_CONTROL, 0x0
.equ	USB_DEVICE_DPRAM_EP1_IN_CONTROL_ENDPOINT_TYPE_VALUE_ISOCHRONOUS, 0x1
.equ	USB_DEVICE_DPRAM_EP1_IN_CONTROL_ENDPOINT_TYPE_VALUE_BULK, 0x2
.equ	USB_DEVICE_DPRAM_EP1_IN_CONTROL_ENDPOINT_TYPE_VALUE_INTERRUPT, 0x3
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP1_IN_CONTROL_INTERRUPT_ON_STALL
# Description : Trigger an interrupt if a STALL is sent. Intended for debug
#               only.
.equ	USB_DEVICE_DPRAM_EP1_IN_CONTROL_INTERRUPT_ON_STALL_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP1_IN_CONTROL_INTERRUPT_ON_STALL_BITS, 0x00020000
.equ	USB_DEVICE_DPRAM_EP1_IN_CONTROL_INTERRUPT_ON_STALL_MSB, 17
.equ	USB_DEVICE_DPRAM_EP1_IN_CONTROL_INTERRUPT_ON_STALL_LSB, 17
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP1_IN_CONTROL_INTERRUPT_ON_NAK
# Description : Trigger an interrupt if a NAK is sent. Intended for debug only.
.equ	USB_DEVICE_DPRAM_EP1_IN_CONTROL_INTERRUPT_ON_NAK_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP1_IN_CONTROL_INTERRUPT_ON_NAK_BITS, 0x00010000
.equ	USB_DEVICE_DPRAM_EP1_IN_CONTROL_INTERRUPT_ON_NAK_MSB, 16
.equ	USB_DEVICE_DPRAM_EP1_IN_CONTROL_INTERRUPT_ON_NAK_LSB, 16
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP1_IN_CONTROL_BUFFER_ADDRESS
# Description : 64 byte aligned buffer address for this EP (bits 0-5 are
#               ignored). Relative to the start of the DPRAM.
.equ	USB_DEVICE_DPRAM_EP1_IN_CONTROL_BUFFER_ADDRESS_RESET, 0x0000
.equ	USB_DEVICE_DPRAM_EP1_IN_CONTROL_BUFFER_ADDRESS_BITS, 0x0000ffff
.equ	USB_DEVICE_DPRAM_EP1_IN_CONTROL_BUFFER_ADDRESS_MSB, 15
.equ	USB_DEVICE_DPRAM_EP1_IN_CONTROL_BUFFER_ADDRESS_LSB, 0
# =============================================================================
# Register    : USB_DEVICE_DPRAM_EP1_OUT_CONTROL
.equ	USB_DEVICE_DPRAM_EP1_OUT_CONTROL_OFFSET, 0x0000000c
.equ	USB_DEVICE_DPRAM_EP1_OUT_CONTROL_BITS, 0xfc03ffff
.equ	USB_DEVICE_DPRAM_EP1_OUT_CONTROL_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP1_OUT_CONTROL_ENABLE
# Description : Enable this endpoint. The device will not reply to any packets
#               for this endpoint if this bit is not set.
.equ	USB_DEVICE_DPRAM_EP1_OUT_CONTROL_ENABLE_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP1_OUT_CONTROL_ENABLE_BITS, 0x80000000
.equ	USB_DEVICE_DPRAM_EP1_OUT_CONTROL_ENABLE_MSB, 31
.equ	USB_DEVICE_DPRAM_EP1_OUT_CONTROL_ENABLE_LSB, 31
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP1_OUT_CONTROL_DOUBLE_BUFFERED
# Description : This endpoint is double buffered.
.equ	USB_DEVICE_DPRAM_EP1_OUT_CONTROL_DOUBLE_BUFFERED_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP1_OUT_CONTROL_DOUBLE_BUFFERED_BITS, 0x40000000
.equ	USB_DEVICE_DPRAM_EP1_OUT_CONTROL_DOUBLE_BUFFERED_MSB, 30
.equ	USB_DEVICE_DPRAM_EP1_OUT_CONTROL_DOUBLE_BUFFERED_LSB, 30
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP1_OUT_CONTROL_INTERRUPT_PER_BUFF
# Description : Trigger an interrupt each time a buffer is done.
.equ	USB_DEVICE_DPRAM_EP1_OUT_CONTROL_INTERRUPT_PER_BUFF_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP1_OUT_CONTROL_INTERRUPT_PER_BUFF_BITS, 0x20000000
.equ	USB_DEVICE_DPRAM_EP1_OUT_CONTROL_INTERRUPT_PER_BUFF_MSB, 29
.equ	USB_DEVICE_DPRAM_EP1_OUT_CONTROL_INTERRUPT_PER_BUFF_LSB, 29
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP1_OUT_CONTROL_INTERRUPT_PER_DOUBLE_BUFF
# Description : Trigger an interrupt each time both buffers are done. Only
#               valid in double buffered mode.
.equ	USB_DEVICE_DPRAM_EP1_OUT_CONTROL_INTERRUPT_PER_DOUBLE_BUFF_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP1_OUT_CONTROL_INTERRUPT_PER_DOUBLE_BUFF_BITS, 0x10000000
.equ	USB_DEVICE_DPRAM_EP1_OUT_CONTROL_INTERRUPT_PER_DOUBLE_BUFF_MSB, 28
.equ	USB_DEVICE_DPRAM_EP1_OUT_CONTROL_INTERRUPT_PER_DOUBLE_BUFF_LSB, 28
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP1_OUT_CONTROL_ENDPOINT_TYPE
#               0x0 -> Control
#               0x1 -> Isochronous
#               0x2 -> Bulk
#               0x3 -> Interrupt
.equ	USB_DEVICE_DPRAM_EP1_OUT_CONTROL_ENDPOINT_TYPE_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP1_OUT_CONTROL_ENDPOINT_TYPE_BITS, 0x0c000000
.equ	USB_DEVICE_DPRAM_EP1_OUT_CONTROL_ENDPOINT_TYPE_MSB, 27
.equ	USB_DEVICE_DPRAM_EP1_OUT_CONTROL_ENDPOINT_TYPE_LSB, 26
.equ	USB_DEVICE_DPRAM_EP1_OUT_CONTROL_ENDPOINT_TYPE_VALUE_CONTROL, 0x0
.equ	USB_DEVICE_DPRAM_EP1_OUT_CONTROL_ENDPOINT_TYPE_VALUE_ISOCHRONOUS, 0x1
.equ	USB_DEVICE_DPRAM_EP1_OUT_CONTROL_ENDPOINT_TYPE_VALUE_BULK, 0x2
.equ	USB_DEVICE_DPRAM_EP1_OUT_CONTROL_ENDPOINT_TYPE_VALUE_INTERRUPT, 0x3
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP1_OUT_CONTROL_INTERRUPT_ON_STALL
# Description : Trigger an interrupt if a STALL is sent. Intended for debug
#               only.
.equ	USB_DEVICE_DPRAM_EP1_OUT_CONTROL_INTERRUPT_ON_STALL_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP1_OUT_CONTROL_INTERRUPT_ON_STALL_BITS, 0x00020000
.equ	USB_DEVICE_DPRAM_EP1_OUT_CONTROL_INTERRUPT_ON_STALL_MSB, 17
.equ	USB_DEVICE_DPRAM_EP1_OUT_CONTROL_INTERRUPT_ON_STALL_LSB, 17
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP1_OUT_CONTROL_INTERRUPT_ON_NAK
# Description : Trigger an interrupt if a NAK is sent. Intended for debug only.
.equ	USB_DEVICE_DPRAM_EP1_OUT_CONTROL_INTERRUPT_ON_NAK_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP1_OUT_CONTROL_INTERRUPT_ON_NAK_BITS, 0x00010000
.equ	USB_DEVICE_DPRAM_EP1_OUT_CONTROL_INTERRUPT_ON_NAK_MSB, 16
.equ	USB_DEVICE_DPRAM_EP1_OUT_CONTROL_INTERRUPT_ON_NAK_LSB, 16
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP1_OUT_CONTROL_BUFFER_ADDRESS
# Description : 64 byte aligned buffer address for this EP (bits 0-5 are
#               ignored). Relative to the start of the DPRAM.
.equ	USB_DEVICE_DPRAM_EP1_OUT_CONTROL_BUFFER_ADDRESS_RESET, 0x0000
.equ	USB_DEVICE_DPRAM_EP1_OUT_CONTROL_BUFFER_ADDRESS_BITS, 0x0000ffff
.equ	USB_DEVICE_DPRAM_EP1_OUT_CONTROL_BUFFER_ADDRESS_MSB, 15
.equ	USB_DEVICE_DPRAM_EP1_OUT_CONTROL_BUFFER_ADDRESS_LSB, 0
# =============================================================================
# Register    : USB_DEVICE_DPRAM_EP2_IN_CONTROL
.equ	USB_DEVICE_DPRAM_EP2_IN_CONTROL_OFFSET, 0x00000010
.equ	USB_DEVICE_DPRAM_EP2_IN_CONTROL_BITS, 0xfc03ffff
.equ	USB_DEVICE_DPRAM_EP2_IN_CONTROL_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP2_IN_CONTROL_ENABLE
# Description : Enable this endpoint. The device will not reply to any packets
#               for this endpoint if this bit is not set.
.equ	USB_DEVICE_DPRAM_EP2_IN_CONTROL_ENABLE_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP2_IN_CONTROL_ENABLE_BITS, 0x80000000
.equ	USB_DEVICE_DPRAM_EP2_IN_CONTROL_ENABLE_MSB, 31
.equ	USB_DEVICE_DPRAM_EP2_IN_CONTROL_ENABLE_LSB, 31
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP2_IN_CONTROL_DOUBLE_BUFFERED
# Description : This endpoint is double buffered.
.equ	USB_DEVICE_DPRAM_EP2_IN_CONTROL_DOUBLE_BUFFERED_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP2_IN_CONTROL_DOUBLE_BUFFERED_BITS, 0x40000000
.equ	USB_DEVICE_DPRAM_EP2_IN_CONTROL_DOUBLE_BUFFERED_MSB, 30
.equ	USB_DEVICE_DPRAM_EP2_IN_CONTROL_DOUBLE_BUFFERED_LSB, 30
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP2_IN_CONTROL_INTERRUPT_PER_BUFF
# Description : Trigger an interrupt each time a buffer is done.
.equ	USB_DEVICE_DPRAM_EP2_IN_CONTROL_INTERRUPT_PER_BUFF_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP2_IN_CONTROL_INTERRUPT_PER_BUFF_BITS, 0x20000000
.equ	USB_DEVICE_DPRAM_EP2_IN_CONTROL_INTERRUPT_PER_BUFF_MSB, 29
.equ	USB_DEVICE_DPRAM_EP2_IN_CONTROL_INTERRUPT_PER_BUFF_LSB, 29
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP2_IN_CONTROL_INTERRUPT_PER_DOUBLE_BUFF
# Description : Trigger an interrupt each time both buffers are done. Only
#               valid in double buffered mode.
.equ	USB_DEVICE_DPRAM_EP2_IN_CONTROL_INTERRUPT_PER_DOUBLE_BUFF_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP2_IN_CONTROL_INTERRUPT_PER_DOUBLE_BUFF_BITS, 0x10000000
.equ	USB_DEVICE_DPRAM_EP2_IN_CONTROL_INTERRUPT_PER_DOUBLE_BUFF_MSB, 28
.equ	USB_DEVICE_DPRAM_EP2_IN_CONTROL_INTERRUPT_PER_DOUBLE_BUFF_LSB, 28
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP2_IN_CONTROL_ENDPOINT_TYPE
#               0x0 -> Control
#               0x1 -> Isochronous
#               0x2 -> Bulk
#               0x3 -> Interrupt
.equ	USB_DEVICE_DPRAM_EP2_IN_CONTROL_ENDPOINT_TYPE_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP2_IN_CONTROL_ENDPOINT_TYPE_BITS, 0x0c000000
.equ	USB_DEVICE_DPRAM_EP2_IN_CONTROL_ENDPOINT_TYPE_MSB, 27
.equ	USB_DEVICE_DPRAM_EP2_IN_CONTROL_ENDPOINT_TYPE_LSB, 26
.equ	USB_DEVICE_DPRAM_EP2_IN_CONTROL_ENDPOINT_TYPE_VALUE_CONTROL, 0x0
.equ	USB_DEVICE_DPRAM_EP2_IN_CONTROL_ENDPOINT_TYPE_VALUE_ISOCHRONOUS, 0x1
.equ	USB_DEVICE_DPRAM_EP2_IN_CONTROL_ENDPOINT_TYPE_VALUE_BULK, 0x2
.equ	USB_DEVICE_DPRAM_EP2_IN_CONTROL_ENDPOINT_TYPE_VALUE_INTERRUPT, 0x3
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP2_IN_CONTROL_INTERRUPT_ON_STALL
# Description : Trigger an interrupt if a STALL is sent. Intended for debug
#               only.
.equ	USB_DEVICE_DPRAM_EP2_IN_CONTROL_INTERRUPT_ON_STALL_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP2_IN_CONTROL_INTERRUPT_ON_STALL_BITS, 0x00020000
.equ	USB_DEVICE_DPRAM_EP2_IN_CONTROL_INTERRUPT_ON_STALL_MSB, 17
.equ	USB_DEVICE_DPRAM_EP2_IN_CONTROL_INTERRUPT_ON_STALL_LSB, 17
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP2_IN_CONTROL_INTERRUPT_ON_NAK
# Description : Trigger an interrupt if a NAK is sent. Intended for debug only.
.equ	USB_DEVICE_DPRAM_EP2_IN_CONTROL_INTERRUPT_ON_NAK_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP2_IN_CONTROL_INTERRUPT_ON_NAK_BITS, 0x00010000
.equ	USB_DEVICE_DPRAM_EP2_IN_CONTROL_INTERRUPT_ON_NAK_MSB, 16
.equ	USB_DEVICE_DPRAM_EP2_IN_CONTROL_INTERRUPT_ON_NAK_LSB, 16
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP2_IN_CONTROL_BUFFER_ADDRESS
# Description : 64 byte aligned buffer address for this EP (bits 0-5 are
#               ignored). Relative to the start of the DPRAM.
.equ	USB_DEVICE_DPRAM_EP2_IN_CONTROL_BUFFER_ADDRESS_RESET, 0x0000
.equ	USB_DEVICE_DPRAM_EP2_IN_CONTROL_BUFFER_ADDRESS_BITS, 0x0000ffff
.equ	USB_DEVICE_DPRAM_EP2_IN_CONTROL_BUFFER_ADDRESS_MSB, 15
.equ	USB_DEVICE_DPRAM_EP2_IN_CONTROL_BUFFER_ADDRESS_LSB, 0
# =============================================================================
# Register    : USB_DEVICE_DPRAM_EP2_OUT_CONTROL
.equ	USB_DEVICE_DPRAM_EP2_OUT_CONTROL_OFFSET, 0x00000014
.equ	USB_DEVICE_DPRAM_EP2_OUT_CONTROL_BITS, 0xfc03ffff
.equ	USB_DEVICE_DPRAM_EP2_OUT_CONTROL_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP2_OUT_CONTROL_ENABLE
# Description : Enable this endpoint. The device will not reply to any packets
#               for this endpoint if this bit is not set.
.equ	USB_DEVICE_DPRAM_EP2_OUT_CONTROL_ENABLE_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP2_OUT_CONTROL_ENABLE_BITS, 0x80000000
.equ	USB_DEVICE_DPRAM_EP2_OUT_CONTROL_ENABLE_MSB, 31
.equ	USB_DEVICE_DPRAM_EP2_OUT_CONTROL_ENABLE_LSB, 31
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP2_OUT_CONTROL_DOUBLE_BUFFERED
# Description : This endpoint is double buffered.
.equ	USB_DEVICE_DPRAM_EP2_OUT_CONTROL_DOUBLE_BUFFERED_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP2_OUT_CONTROL_DOUBLE_BUFFERED_BITS, 0x40000000
.equ	USB_DEVICE_DPRAM_EP2_OUT_CONTROL_DOUBLE_BUFFERED_MSB, 30
.equ	USB_DEVICE_DPRAM_EP2_OUT_CONTROL_DOUBLE_BUFFERED_LSB, 30
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP2_OUT_CONTROL_INTERRUPT_PER_BUFF
# Description : Trigger an interrupt each time a buffer is done.
.equ	USB_DEVICE_DPRAM_EP2_OUT_CONTROL_INTERRUPT_PER_BUFF_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP2_OUT_CONTROL_INTERRUPT_PER_BUFF_BITS, 0x20000000
.equ	USB_DEVICE_DPRAM_EP2_OUT_CONTROL_INTERRUPT_PER_BUFF_MSB, 29
.equ	USB_DEVICE_DPRAM_EP2_OUT_CONTROL_INTERRUPT_PER_BUFF_LSB, 29
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP2_OUT_CONTROL_INTERRUPT_PER_DOUBLE_BUFF
# Description : Trigger an interrupt each time both buffers are done. Only
#               valid in double buffered mode.
.equ	USB_DEVICE_DPRAM_EP2_OUT_CONTROL_INTERRUPT_PER_DOUBLE_BUFF_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP2_OUT_CONTROL_INTERRUPT_PER_DOUBLE_BUFF_BITS, 0x10000000
.equ	USB_DEVICE_DPRAM_EP2_OUT_CONTROL_INTERRUPT_PER_DOUBLE_BUFF_MSB, 28
.equ	USB_DEVICE_DPRAM_EP2_OUT_CONTROL_INTERRUPT_PER_DOUBLE_BUFF_LSB, 28
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP2_OUT_CONTROL_ENDPOINT_TYPE
#               0x0 -> Control
#               0x1 -> Isochronous
#               0x2 -> Bulk
#               0x3 -> Interrupt
.equ	USB_DEVICE_DPRAM_EP2_OUT_CONTROL_ENDPOINT_TYPE_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP2_OUT_CONTROL_ENDPOINT_TYPE_BITS, 0x0c000000
.equ	USB_DEVICE_DPRAM_EP2_OUT_CONTROL_ENDPOINT_TYPE_MSB, 27
.equ	USB_DEVICE_DPRAM_EP2_OUT_CONTROL_ENDPOINT_TYPE_LSB, 26
.equ	USB_DEVICE_DPRAM_EP2_OUT_CONTROL_ENDPOINT_TYPE_VALUE_CONTROL, 0x0
.equ	USB_DEVICE_DPRAM_EP2_OUT_CONTROL_ENDPOINT_TYPE_VALUE_ISOCHRONOUS, 0x1
.equ	USB_DEVICE_DPRAM_EP2_OUT_CONTROL_ENDPOINT_TYPE_VALUE_BULK, 0x2
.equ	USB_DEVICE_DPRAM_EP2_OUT_CONTROL_ENDPOINT_TYPE_VALUE_INTERRUPT, 0x3
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP2_OUT_CONTROL_INTERRUPT_ON_STALL
# Description : Trigger an interrupt if a STALL is sent. Intended for debug
#               only.
.equ	USB_DEVICE_DPRAM_EP2_OUT_CONTROL_INTERRUPT_ON_STALL_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP2_OUT_CONTROL_INTERRUPT_ON_STALL_BITS, 0x00020000
.equ	USB_DEVICE_DPRAM_EP2_OUT_CONTROL_INTERRUPT_ON_STALL_MSB, 17
.equ	USB_DEVICE_DPRAM_EP2_OUT_CONTROL_INTERRUPT_ON_STALL_LSB, 17
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP2_OUT_CONTROL_INTERRUPT_ON_NAK
# Description : Trigger an interrupt if a NAK is sent. Intended for debug only.
.equ	USB_DEVICE_DPRAM_EP2_OUT_CONTROL_INTERRUPT_ON_NAK_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP2_OUT_CONTROL_INTERRUPT_ON_NAK_BITS, 0x00010000
.equ	USB_DEVICE_DPRAM_EP2_OUT_CONTROL_INTERRUPT_ON_NAK_MSB, 16
.equ	USB_DEVICE_DPRAM_EP2_OUT_CONTROL_INTERRUPT_ON_NAK_LSB, 16
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP2_OUT_CONTROL_BUFFER_ADDRESS
# Description : 64 byte aligned buffer address for this EP (bits 0-5 are
#               ignored). Relative to the start of the DPRAM.
.equ	USB_DEVICE_DPRAM_EP2_OUT_CONTROL_BUFFER_ADDRESS_RESET, 0x0000
.equ	USB_DEVICE_DPRAM_EP2_OUT_CONTROL_BUFFER_ADDRESS_BITS, 0x0000ffff
.equ	USB_DEVICE_DPRAM_EP2_OUT_CONTROL_BUFFER_ADDRESS_MSB, 15
.equ	USB_DEVICE_DPRAM_EP2_OUT_CONTROL_BUFFER_ADDRESS_LSB, 0
# =============================================================================
# Register    : USB_DEVICE_DPRAM_EP3_IN_CONTROL
.equ	USB_DEVICE_DPRAM_EP3_IN_CONTROL_OFFSET, 0x00000018
.equ	USB_DEVICE_DPRAM_EP3_IN_CONTROL_BITS, 0xfc03ffff
.equ	USB_DEVICE_DPRAM_EP3_IN_CONTROL_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP3_IN_CONTROL_ENABLE
# Description : Enable this endpoint. The device will not reply to any packets
#               for this endpoint if this bit is not set.
.equ	USB_DEVICE_DPRAM_EP3_IN_CONTROL_ENABLE_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP3_IN_CONTROL_ENABLE_BITS, 0x80000000
.equ	USB_DEVICE_DPRAM_EP3_IN_CONTROL_ENABLE_MSB, 31
.equ	USB_DEVICE_DPRAM_EP3_IN_CONTROL_ENABLE_LSB, 31
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP3_IN_CONTROL_DOUBLE_BUFFERED
# Description : This endpoint is double buffered.
.equ	USB_DEVICE_DPRAM_EP3_IN_CONTROL_DOUBLE_BUFFERED_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP3_IN_CONTROL_DOUBLE_BUFFERED_BITS, 0x40000000
.equ	USB_DEVICE_DPRAM_EP3_IN_CONTROL_DOUBLE_BUFFERED_MSB, 30
.equ	USB_DEVICE_DPRAM_EP3_IN_CONTROL_DOUBLE_BUFFERED_LSB, 30
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP3_IN_CONTROL_INTERRUPT_PER_BUFF
# Description : Trigger an interrupt each time a buffer is done.
.equ	USB_DEVICE_DPRAM_EP3_IN_CONTROL_INTERRUPT_PER_BUFF_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP3_IN_CONTROL_INTERRUPT_PER_BUFF_BITS, 0x20000000
.equ	USB_DEVICE_DPRAM_EP3_IN_CONTROL_INTERRUPT_PER_BUFF_MSB, 29
.equ	USB_DEVICE_DPRAM_EP3_IN_CONTROL_INTERRUPT_PER_BUFF_LSB, 29
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP3_IN_CONTROL_INTERRUPT_PER_DOUBLE_BUFF
# Description : Trigger an interrupt each time both buffers are done. Only
#               valid in double buffered mode.
.equ	USB_DEVICE_DPRAM_EP3_IN_CONTROL_INTERRUPT_PER_DOUBLE_BUFF_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP3_IN_CONTROL_INTERRUPT_PER_DOUBLE_BUFF_BITS, 0x10000000
.equ	USB_DEVICE_DPRAM_EP3_IN_CONTROL_INTERRUPT_PER_DOUBLE_BUFF_MSB, 28
