konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/usb_device_dpram.inc
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP13_OUT_CONTROL_ENABLE
# Description : Enable this endpoint. The device will not reply to any packets
#               for this endpoint if this bit is not set.
.equ	USB_DEVICE_DPRAM_EP13_OUT_CONTROL_ENABLE_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP13_OUT_CONTROL_ENABLE_BITS, 0x80000000
.equ	USB_DEVICE_DPRAM_EP13_OUT_CONTROL_ENABLE_MSB, 31
.equ	USB_DEVICE_DPRAM_EP13_OUT_CONTROL_ENABLE_LSB, 31
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP13_OUT_CONTROL_DOUBLE_BUFFERED
# Description : This endpoint is double buffered.
.equ	USB_DEVICE_DPRAM_EP13_OUT_CONTROL_DOUBLE_BUFFERED_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP13_OUT_CONTROL_DOUBLE_BUFFERED_BITS, 0x40000000
.equ	USB_DEVICE_DPRAM_EP13_OUT_CONTROL_DOUBLE_BUFFERED_MSB, 30
.equ	USB_DEVICE_DPRAM_EP13_OUT_CONTROL_DOUBLE_BUFFERED_LSB, 30
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP13_OUT_CONTROL_INTERRUPT_PER_BUFF
# Description : Trigger an interrupt each time a buffer is done.
.equ	USB_DEVICE_DPRAM_EP13_OUT_CONTROL_INTERRUPT_PER_BUFF_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP13_OUT_CONTROL_INTERRUPT_PER_BUFF_BITS, 0x20000000
.equ	USB_DEVICE_DPRAM_EP13_OUT_CONTROL_INTERRUPT_PER_BUFF_MSB, 29
.equ	USB_DEVICE_DPRAM_EP13_OUT_CONTROL_INTERRUPT_PER_BUFF_LSB, 29
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP13_OUT_CONTROL_INTERRUPT_PER_DOUBLE_BUFF
# Description : Trigger an interrupt each time both buffers are done. Only
#               valid in double buffered mode.
.equ	USB_DEVICE_DPRAM_EP13_OUT_CONTROL_INTERRUPT_PER_DOUBLE_BUFF_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP13_OUT_CONTROL_INTERRUPT_PER_DOUBLE_BUFF_BITS, 0x10000000
.equ	USB_DEVICE_DPRAM_EP13_OUT_CONTROL_INTERRUPT_PER_DOUBLE_BUFF_MSB, 28
.equ	USB_DEVICE_DPRAM_EP13_OUT_CONTROL_INTERRUPT_PER_DOUBLE_BUFF_LSB, 28
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP13_OUT_CONTROL_ENDPOINT_TYPE
#               0x0 -> Control
#               0x1 -> Isochronous
#               0x2 -> Bulk
#               0x3 -> Interrupt
.equ	USB_DEVICE_DPRAM_EP13_OUT_CONTROL_ENDPOINT_TYPE_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP13_OUT_CONTROL_ENDPOINT_TYPE_BITS, 0x0c000000
.equ	USB_DEVICE_DPRAM_EP13_OUT_CONTROL_ENDPOINT_TYPE_MSB, 27
.equ	USB_DEVICE_DPRAM_EP13_OUT_CONTROL_ENDPOINT_TYPE_LSB, 26
.equ	USB_DEVICE_DPRAM_EP13_OUT_CONTROL_ENDPOINT_TYPE_VALUE_CONTROL, 0x0
.equ	USB_DEVICE_DPRAM_EP13_OUT_CONTROL_ENDPOINT_TYPE_VALUE_ISOCHRONOUS, 0x1
.equ	USB_DEVICE_DPRAM_EP13_OUT_CONTROL_ENDPOINT_TYPE_VALUE_BULK, 0x2
.equ	USB_DEVICE_DPRAM_EP13_OUT_CONTROL_ENDPOINT_TYPE_VALUE_INTERRUPT, 0x3
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP13_OUT_CONTROL_INTERRUPT_ON_STALL
# Description : Trigger an interrupt if a STALL is sent. Intended for debug
#               only.
.equ	USB_DEVICE_DPRAM_EP13_OUT_CONTROL_INTERRUPT_ON_STALL_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP13_OUT_CONTROL_INTERRUPT_ON_STALL_BITS, 0x00020000
.equ	USB_DEVICE_DPRAM_EP13_OUT_CONTROL_INTERRUPT_ON_STALL_MSB, 17
.equ	USB_DEVICE_DPRAM_EP13_OUT_CONTROL_INTERRUPT_ON_STALL_LSB, 17
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP13_OUT_CONTROL_INTERRUPT_ON_NAK
# Description : Trigger an interrupt if a NAK is sent. Intended for debug only.
.equ	USB_DEVICE_DPRAM_EP13_OUT_CONTROL_INTERRUPT_ON_NAK_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP13_OUT_CONTROL_INTERRUPT_ON_NAK_BITS, 0x00010000
.equ	USB_DEVICE_DPRAM_EP13_OUT_CONTROL_INTERRUPT_ON_NAK_MSB, 16
.equ	USB_DEVICE_DPRAM_EP13_OUT_CONTROL_INTERRUPT_ON_NAK_LSB, 16
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP13_OUT_CONTROL_BUFFER_ADDRESS
# Description : 64 byte aligned buffer address for this EP (bits 0-5 are
#               ignored). Relative to the start of the DPRAM.
.equ	USB_DEVICE_DPRAM_EP13_OUT_CONTROL_BUFFER_ADDRESS_RESET, 0x0000
.equ	USB_DEVICE_DPRAM_EP13_OUT_CONTROL_BUFFER_ADDRESS_BITS, 0x0000ffff
.equ	USB_DEVICE_DPRAM_EP13_OUT_CONTROL_BUFFER_ADDRESS_MSB, 15
.equ	USB_DEVICE_DPRAM_EP13_OUT_CONTROL_BUFFER_ADDRESS_LSB, 0
# =============================================================================
# Register    : USB_DEVICE_DPRAM_EP14_IN_CONTROL
.equ	USB_DEVICE_DPRAM_EP14_IN_CONTROL_OFFSET, 0x00000070
.equ	USB_DEVICE_DPRAM_EP14_IN_CONTROL_BITS, 0xfc03ffff
.equ	USB_DEVICE_DPRAM_EP14_IN_CONTROL_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP14_IN_CONTROL_ENABLE
# Description : Enable this endpoint. The device will not reply to any packets
#               for this endpoint if this bit is not set.
.equ	USB_DEVICE_DPRAM_EP14_IN_CONTROL_ENABLE_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP14_IN_CONTROL_ENABLE_BITS, 0x80000000
.equ	USB_DEVICE_DPRAM_EP14_IN_CONTROL_ENABLE_MSB, 31
.equ	USB_DEVICE_DPRAM_EP14_IN_CONTROL_ENABLE_LSB, 31
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP14_IN_CONTROL_DOUBLE_BUFFERED
# Description : This endpoint is double buffered.
.equ	USB_DEVICE_DPRAM_EP14_IN_CONTROL_DOUBLE_BUFFERED_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP14_IN_CONTROL_DOUBLE_BUFFERED_BITS, 0x40000000
.equ	USB_DEVICE_DPRAM_EP14_IN_CONTROL_DOUBLE_BUFFERED_MSB, 30
.equ	USB_DEVICE_DPRAM_EP14_IN_CONTROL_DOUBLE_BUFFERED_LSB, 30
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP14_IN_CONTROL_INTERRUPT_PER_BUFF
# Description : Trigger an interrupt each time a buffer is done.
.equ	USB_DEVICE_DPRAM_EP14_IN_CONTROL_INTERRUPT_PER_BUFF_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP14_IN_CONTROL_INTERRUPT_PER_BUFF_BITS, 0x20000000
.equ	USB_DEVICE_DPRAM_EP14_IN_CONTROL_INTERRUPT_PER_BUFF_MSB, 29
.equ	USB_DEVICE_DPRAM_EP14_IN_CONTROL_INTERRUPT_PER_BUFF_LSB, 29
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP14_IN_CONTROL_INTERRUPT_PER_DOUBLE_BUFF
# Description : Trigger an interrupt each time both buffers are done. Only
#               valid in double buffered mode.
.equ	USB_DEVICE_DPRAM_EP14_IN_CONTROL_INTERRUPT_PER_DOUBLE_BUFF_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP14_IN_CONTROL_INTERRUPT_PER_DOUBLE_BUFF_BITS, 0x10000000
.equ	USB_DEVICE_DPRAM_EP14_IN_CONTROL_INTERRUPT_PER_DOUBLE_BUFF_MSB, 28
.equ	USB_DEVICE_DPRAM_EP14_IN_CONTROL_INTERRUPT_PER_DOUBLE_BUFF_LSB, 28
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP14_IN_CONTROL_ENDPOINT_TYPE
#               0x0 -> Control
#               0x1 -> Isochronous
#               0x2 -> Bulk
#               0x3 -> Interrupt
.equ	USB_DEVICE_DPRAM_EP14_IN_CONTROL_ENDPOINT_TYPE_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP14_IN_CONTROL_ENDPOINT_TYPE_BITS, 0x0c000000
.equ	USB_DEVICE_DPRAM_EP14_IN_CONTROL_ENDPOINT_TYPE_MSB, 27
.equ	USB_DEVICE_DPRAM_EP14_IN_CONTROL_ENDPOINT_TYPE_LSB, 26
.equ	USB_DEVICE_DPRAM_EP14_IN_CONTROL_ENDPOINT_TYPE_VALUE_CONTROL, 0x0
.equ	USB_DEVICE_DPRAM_EP14_IN_CONTROL_ENDPOINT_TYPE_VALUE_ISOCHRONOUS, 0x1
.equ	USB_DEVICE_DPRAM_EP14_IN_CONTROL_ENDPOINT_TYPE_VALUE_BULK, 0x2
.equ	USB_DEVICE_DPRAM_EP14_IN_CONTROL_ENDPOINT_TYPE_VALUE_INTERRUPT, 0x3
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP14_IN_CONTROL_INTERRUPT_ON_STALL
# Description : Trigger an interrupt if a STALL is sent. Intended for debug
#               only.
.equ	USB_DEVICE_DPRAM_EP14_IN_CONTROL_INTERRUPT_ON_STALL_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP14_IN_CONTROL_INTERRUPT_ON_STALL_BITS, 0x00020000
.equ	USB_DEVICE_DPRAM_EP14_IN_CONTROL_INTERRUPT_ON_STALL_MSB, 17
.equ	USB_DEVICE_DPRAM_EP14_IN_CONTROL_INTERRUPT_ON_STALL_LSB, 17
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP14_IN_CONTROL_INTERRUPT_ON_NAK
# Description : Trigger an interrupt if a NAK is sent. Intended for debug only.
.equ	USB_DEVICE_DPRAM_EP14_IN_CONTROL_INTERRUPT_ON_NAK_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP14_IN_CONTROL_INTERRUPT_ON_NAK_BITS, 0x00010000
.equ	USB_DEVICE_DPRAM_EP14_IN_CONTROL_INTERRUPT_ON_NAK_MSB, 16
.equ	USB_DEVICE_DPRAM_EP14_IN_CONTROL_INTERRUPT_ON_NAK_LSB, 16
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP14_IN_CONTROL_BUFFER_ADDRESS
# Description : 64 byte aligned buffer address for this EP (bits 0-5 are
#               ignored). Relative to the start of the DPRAM.
.equ	USB_DEVICE_DPRAM_EP14_IN_CONTROL_BUFFER_ADDRESS_RESET, 0x0000
.equ	USB_DEVICE_DPRAM_EP14_IN_CONTROL_BUFFER_ADDRESS_BITS, 0x0000ffff
.equ	USB_DEVICE_DPRAM_EP14_IN_CONTROL_BUFFER_ADDRESS_MSB, 15
.equ	USB_DEVICE_DPRAM_EP14_IN_CONTROL_BUFFER_ADDRESS_LSB, 0
# =============================================================================
# Register    : USB_DEVICE_DPRAM_EP14_OUT_CONTROL
.equ	USB_DEVICE_DPRAM_EP14_OUT_CONTROL_OFFSET, 0x00000074
.equ	USB_DEVICE_DPRAM_EP14_OUT_CONTROL_BITS, 0xfc03ffff
.equ	USB_DEVICE_DPRAM_EP14_OUT_CONTROL_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP14_OUT_CONTROL_ENABLE
# Description : Enable this endpoint. The device will not reply to any packets
#               for this endpoint if this bit is not set.
.equ	USB_DEVICE_DPRAM_EP14_OUT_CONTROL_ENABLE_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP14_OUT_CONTROL_ENABLE_BITS, 0x80000000
.equ	USB_DEVICE_DPRAM_EP14_OUT_CONTROL_ENABLE_MSB, 31
.equ	USB_DEVICE_DPRAM_EP14_OUT_CONTROL_ENABLE_LSB, 31
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP14_OUT_CONTROL_DOUBLE_BUFFERED
# Description : This endpoint is double buffered.
.equ	USB_DEVICE_DPRAM_EP14_OUT_CONTROL_DOUBLE_BUFFERED_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP14_OUT_CONTROL_DOUBLE_BUFFERED_BITS, 0x40000000
.equ	USB_DEVICE_DPRAM_EP14_OUT_CONTROL_DOUBLE_BUFFERED_MSB, 30
.equ	USB_DEVICE_DPRAM_EP14_OUT_CONTROL_DOUBLE_BUFFERED_LSB, 30
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP14_OUT_CONTROL_INTERRUPT_PER_BUFF
# Description : Trigger an interrupt each time a buffer is done.
.equ	USB_DEVICE_DPRAM_EP14_OUT_CONTROL_INTERRUPT_PER_BUFF_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP14_OUT_CONTROL_INTERRUPT_PER_BUFF_BITS, 0x20000000
.equ	USB_DEVICE_DPRAM_EP14_OUT_CONTROL_INTERRUPT_PER_BUFF_MSB, 29
.equ	USB_DEVICE_DPRAM_EP14_OUT_CONTROL_INTERRUPT_PER_BUFF_LSB, 29
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP14_OUT_CONTROL_INTERRUPT_PER_DOUBLE_BUFF
# Description : Trigger an interrupt each time both buffers are done. Only
#               valid in double buffered mode.
.equ	USB_DEVICE_DPRAM_EP14_OUT_CONTROL_INTERRUPT_PER_DOUBLE_BUFF_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP14_OUT_CONTROL_INTERRUPT_PER_DOUBLE_BUFF_BITS, 0x10000000
.equ	USB_DEVICE_DPRAM_EP14_OUT_CONTROL_INTERRUPT_PER_DOUBLE_BUFF_MSB, 28
.equ	USB_DEVICE_DPRAM_EP14_OUT_CONTROL_INTERRUPT_PER_DOUBLE_BUFF_LSB, 28
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP14_OUT_CONTROL_ENDPOINT_TYPE
#               0x0 -> Control
#               0x1 -> Isochronous
#               0x2 -> Bulk
#               0x3 -> Interrupt
.equ	USB_DEVICE_DPRAM_EP14_OUT_CONTROL_ENDPOINT_TYPE_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP14_OUT_CONTROL_ENDPOINT_TYPE_BITS, 0x0c000000
.equ	USB_DEVICE_DPRAM_EP14_OUT_CONTROL_ENDPOINT_TYPE_MSB, 27
.equ	USB_DEVICE_DPRAM_EP14_OUT_CONTROL_ENDPOINT_TYPE_LSB, 26
.equ	USB_DEVICE_DPRAM_EP14_OUT_CONTROL_ENDPOINT_TYPE_VALUE_CONTROL, 0x0
.equ	USB_DEVICE_DPRAM_EP14_OUT_CONTROL_ENDPOINT_TYPE_VALUE_ISOCHRONOUS, 0x1
.equ	USB_DEVICE_DPRAM_EP14_OUT_CONTROL_ENDPOINT_TYPE_VALUE_BULK, 0x2
.equ	USB_DEVICE_DPRAM_EP14_OUT_CONTROL_ENDPOINT_TYPE_VALUE_INTERRUPT, 0x3
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP14_OUT_CONTROL_INTERRUPT_ON_STALL
# Description : Trigger an interrupt if a STALL is sent. Intended for debug
#               only.
.equ	USB_DEVICE_DPRAM_EP14_OUT_CONTROL_INTERRUPT_ON_STALL_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP14_OUT_CONTROL_INTERRUPT_ON_STALL_BITS, 0x00020000
.equ	USB_DEVICE_DPRAM_EP14_OUT_CONTROL_INTERRUPT_ON_STALL_MSB, 17
.equ	USB_DEVICE_DPRAM_EP14_OUT_CONTROL_INTERRUPT_ON_STALL_LSB, 17
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP14_OUT_CONTROL_INTERRUPT_ON_NAK
# Description : Trigger an interrupt if a NAK is sent. Intended for debug only.
.equ	USB_DEVICE_DPRAM_EP14_OUT_CONTROL_INTERRUPT_ON_NAK_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP14_OUT_CONTROL_INTERRUPT_ON_NAK_BITS, 0x00010000
.equ	USB_DEVICE_DPRAM_EP14_OUT_CONTROL_INTERRUPT_ON_NAK_MSB, 16
.equ	USB_DEVICE_DPRAM_EP14_OUT_CONTROL_INTERRUPT_ON_NAK_LSB, 16
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP14_OUT_CONTROL_BUFFER_ADDRESS
# Description : 64 byte aligned buffer address for this EP (bits 0-5 are
#               ignored). Relative to the start of the DPRAM.
.equ	USB_DEVICE_DPRAM_EP14_OUT_CONTROL_BUFFER_ADDRESS_RESET, 0x0000
.equ	USB_DEVICE_DPRAM_EP14_OUT_CONTROL_BUFFER_ADDRESS_BITS, 0x0000ffff
.equ	USB_DEVICE_DPRAM_EP14_OUT_CONTROL_BUFFER_ADDRESS_MSB, 15
.equ	USB_DEVICE_DPRAM_EP14_OUT_CONTROL_BUFFER_ADDRESS_LSB, 0
# =============================================================================
# Register    : USB_DEVICE_DPRAM_EP15_IN_CONTROL
.equ	USB_DEVICE_DPRAM_EP15_IN_CONTROL_OFFSET, 0x00000078
.equ	USB_DEVICE_DPRAM_EP15_IN_CONTROL_BITS, 0xfc03ffff
.equ	USB_DEVICE_DPRAM_EP15_IN_CONTROL_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP15_IN_CONTROL_ENABLE
# Description : Enable this endpoint. The device will not reply to any packets
#               for this endpoint if this bit is not set.
.equ	USB_DEVICE_DPRAM_EP15_IN_CONTROL_ENABLE_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP15_IN_CONTROL_ENABLE_BITS, 0x80000000
.equ	USB_DEVICE_DPRAM_EP15_IN_CONTROL_ENABLE_MSB, 31
.equ	USB_DEVICE_DPRAM_EP15_IN_CONTROL_ENABLE_LSB, 31
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP15_IN_CONTROL_DOUBLE_BUFFERED
# Description : This endpoint is double buffered.
.equ	USB_DEVICE_DPRAM_EP15_IN_CONTROL_DOUBLE_BUFFERED_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP15_IN_CONTROL_DOUBLE_BUFFERED_BITS, 0x40000000
.equ	USB_DEVICE_DPRAM_EP15_IN_CONTROL_DOUBLE_BUFFERED_MSB, 30
.equ	USB_DEVICE_DPRAM_EP15_IN_CONTROL_DOUBLE_BUFFERED_LSB, 30
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP15_IN_CONTROL_INTERRUPT_PER_BUFF
# Description : Trigger an interrupt each time a buffer is done.
.equ	USB_DEVICE_DPRAM_EP15_IN_CONTROL_INTERRUPT_PER_BUFF_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP15_IN_CONTROL_INTERRUPT_PER_BUFF_BITS, 0x20000000
.equ	USB_DEVICE_DPRAM_EP15_IN_CONTROL_INTERRUPT_PER_BUFF_MSB, 29
.equ	USB_DEVICE_DPRAM_EP15_IN_CONTROL_INTERRUPT_PER_BUFF_LSB, 29
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP15_IN_CONTROL_INTERRUPT_PER_DOUBLE_BUFF
# Description : Trigger an interrupt each time both buffers are done. Only
#               valid in double buffered mode.
.equ	USB_DEVICE_DPRAM_EP15_IN_CONTROL_INTERRUPT_PER_DOUBLE_BUFF_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP15_IN_CONTROL_INTERRUPT_PER_DOUBLE_BUFF_BITS, 0x10000000
.equ	USB_DEVICE_DPRAM_EP15_IN_CONTROL_INTERRUPT_PER_DOUBLE_BUFF_MSB, 28
.equ	USB_DEVICE_DPRAM_EP15_IN_CONTROL_INTERRUPT_PER_DOUBLE_BUFF_LSB, 28
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP15_IN_CONTROL_ENDPOINT_TYPE
#               0x0 -> Control
#               0x1 -> Isochronous
#               0x2 -> Bulk
#               0x3 -> Interrupt
.equ	USB_DEVICE_DPRAM_EP15_IN_CONTROL_ENDPOINT_TYPE_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP15_IN_CONTROL_ENDPOINT_TYPE_BITS, 0x0c000000
.equ	USB_DEVICE_DPRAM_EP15_IN_CONTROL_ENDPOINT_TYPE_MSB, 27
.equ	USB_DEVICE_DPRAM_EP15_IN_CONTROL_ENDPOINT_TYPE_LSB, 26
.equ	USB_DEVICE_DPRAM_EP15_IN_CONTROL_ENDPOINT_TYPE_VALUE_CONTROL, 0x0
.equ	USB_DEVICE_DPRAM_EP15_IN_CONTROL_ENDPOINT_TYPE_VALUE_ISOCHRONOUS, 0x1
.equ	USB_DEVICE_DPRAM_EP15_IN_CONTROL_ENDPOINT_TYPE_VALUE_BULK, 0x2
.equ	USB_DEVICE_DPRAM_EP15_IN_CONTROL_ENDPOINT_TYPE_VALUE_INTERRUPT, 0x3
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP15_IN_CONTROL_INTERRUPT_ON_STALL
# Description : Trigger an interrupt if a STALL is sent. Intended for debug
#               only.
.equ	USB_DEVICE_DPRAM_EP15_IN_CONTROL_INTERRUPT_ON_STALL_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP15_IN_CONTROL_INTERRUPT_ON_STALL_BITS, 0x00020000
.equ	USB_DEVICE_DPRAM_EP15_IN_CONTROL_INTERRUPT_ON_STALL_MSB, 17
.equ	USB_DEVICE_DPRAM_EP15_IN_CONTROL_INTERRUPT_ON_STALL_LSB, 17
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP15_IN_CONTROL_INTERRUPT_ON_NAK
# Description : Trigger an interrupt if a NAK is sent. Intended for debug only.
.equ	USB_DEVICE_DPRAM_EP15_IN_CONTROL_INTERRUPT_ON_NAK_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP15_IN_CONTROL_INTERRUPT_ON_NAK_BITS, 0x00010000
.equ	USB_DEVICE_DPRAM_EP15_IN_CONTROL_INTERRUPT_ON_NAK_MSB, 16
.equ	USB_DEVICE_DPRAM_EP15_IN_CONTROL_INTERRUPT_ON_NAK_LSB, 16
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP15_IN_CONTROL_BUFFER_ADDRESS
# Description : 64 byte aligned buffer address for this EP (bits 0-5 are
#               ignored). Relative to the start of the DPRAM.
.equ	USB_DEVICE_DPRAM_EP15_IN_CONTROL_BUFFER_ADDRESS_RESET, 0x0000
.equ	USB_DEVICE_DPRAM_EP15_IN_CONTROL_BUFFER_ADDRESS_BITS, 0x0000ffff
.equ	USB_DEVICE_DPRAM_EP15_IN_CONTROL_BUFFER_ADDRESS_MSB, 15
.equ	USB_DEVICE_DPRAM_EP15_IN_CONTROL_BUFFER_ADDRESS_LSB, 0
# =============================================================================
# Register    : USB_DEVICE_DPRAM_EP15_OUT_CONTROL
.equ	USB_DEVICE_DPRAM_EP15_OUT_CONTROL_OFFSET, 0x0000007c
.equ	USB_DEVICE_DPRAM_EP15_OUT_CONTROL_BITS, 0xfc03ffff
.equ	USB_DEVICE_DPRAM_EP15_OUT_CONTROL_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP15_OUT_CONTROL_ENABLE
# Description : Enable this endpoint. The device will not reply to any packets
#               for this endpoint if this bit is not set.
.equ	USB_DEVICE_DPRAM_EP15_OUT_CONTROL_ENABLE_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP15_OUT_CONTROL_ENABLE_BITS, 0x80000000
.equ	USB_DEVICE_DPRAM_EP15_OUT_CONTROL_ENABLE_MSB, 31
.equ	USB_DEVICE_DPRAM_EP15_OUT_CONTROL_ENABLE_LSB, 31
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP15_OUT_CONTROL_DOUBLE_BUFFERED
# Description : This endpoint is double buffered.
.equ	USB_DEVICE_DPRAM_EP15_OUT_CONTROL_DOUBLE_BUFFERED_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP15_OUT_CONTROL_DOUBLE_BUFFERED_BITS, 0x40000000
.equ	USB_DEVICE_DPRAM_EP15_OUT_CONTROL_DOUBLE_BUFFERED_MSB, 30
.equ	USB_DEVICE_DPRAM_EP15_OUT_CONTROL_DOUBLE_BUFFERED_LSB, 30
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP15_OUT_CONTROL_INTERRUPT_PER_BUFF
# Description : Trigger an interrupt each time a buffer is done.
.equ	USB_DEVICE_DPRAM_EP15_OUT_CONTROL_INTERRUPT_PER_BUFF_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP15_OUT_CONTROL_INTERRUPT_PER_BUFF_BITS, 0x20000000
.equ	USB_DEVICE_DPRAM_EP15_OUT_CONTROL_INTERRUPT_PER_BUFF_MSB, 29
.equ	USB_DEVICE_DPRAM_EP15_OUT_CONTROL_INTERRUPT_PER_BUFF_LSB, 29
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP15_OUT_CONTROL_INTERRUPT_PER_DOUBLE_BUFF
# Description : Trigger an interrupt each time both buffers are done. Only
#               valid in double buffered mode.
.equ	USB_DEVICE_DPRAM_EP15_OUT_CONTROL_INTERRUPT_PER_DOUBLE_BUFF_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP15_OUT_CONTROL_INTERRUPT_PER_DOUBLE_BUFF_BITS, 0x10000000
.equ	USB_DEVICE_DPRAM_EP15_OUT_CONTROL_INTERRUPT_PER_DOUBLE_BUFF_MSB, 28
.equ	USB_DEVICE_DPRAM_EP15_OUT_CONTROL_INTERRUPT_PER_DOUBLE_BUFF_LSB, 28
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP15_OUT_CONTROL_ENDPOINT_TYPE
#               0x0 -> Control
#               0x1 -> Isochronous
#               0x2 -> Bulk
#               0x3 -> Interrupt
.equ	USB_DEVICE_DPRAM_EP15_OUT_CONTROL_ENDPOINT_TYPE_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP15_OUT_CONTROL_ENDPOINT_TYPE_BITS, 0x0c000000
.equ	USB_DEVICE_DPRAM_EP15_OUT_CONTROL_ENDPOINT_TYPE_MSB, 27
.equ	USB_DEVICE_DPRAM_EP15_OUT_CONTROL_ENDPOINT_TYPE_LSB, 26
.equ	USB_DEVICE_DPRAM_EP15_OUT_CONTROL_ENDPOINT_TYPE_VALUE_CONTROL, 0x0
.equ	USB_DEVICE_DPRAM_EP15_OUT_CONTROL_ENDPOINT_TYPE_VALUE_ISOCHRONOUS, 0x1
.equ	USB_DEVICE_DPRAM_EP15_OUT_CONTROL_ENDPOINT_TYPE_VALUE_BULK, 0x2
.equ	USB_DEVICE_DPRAM_EP15_OUT_CONTROL_ENDPOINT_TYPE_VALUE_INTERRUPT, 0x3
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP15_OUT_CONTROL_INTERRUPT_ON_STALL
# Description : Trigger an interrupt if a STALL is sent. Intended for debug
#               only.
.equ	USB_DEVICE_DPRAM_EP15_OUT_CONTROL_INTERRUPT_ON_STALL_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP15_OUT_CONTROL_INTERRUPT_ON_STALL_BITS, 0x00020000
.equ	USB_DEVICE_DPRAM_EP15_OUT_CONTROL_INTERRUPT_ON_STALL_MSB, 17
.equ	USB_DEVICE_DPRAM_EP15_OUT_CONTROL_INTERRUPT_ON_STALL_LSB, 17
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP15_OUT_CONTROL_INTERRUPT_ON_NAK
# Description : Trigger an interrupt if a NAK is sent. Intended for debug only.
.equ	USB_DEVICE_DPRAM_EP15_OUT_CONTROL_INTERRUPT_ON_NAK_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP15_OUT_CONTROL_INTERRUPT_ON_NAK_BITS, 0x00010000
.equ	USB_DEVICE_DPRAM_EP15_OUT_CONTROL_INTERRUPT_ON_NAK_MSB, 16
.equ	USB_DEVICE_DPRAM_EP15_OUT_CONTROL_INTERRUPT_ON_NAK_LSB, 16
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP15_OUT_CONTROL_BUFFER_ADDRESS
# Description : 64 byte aligned buffer address for this EP (bits 0-5 are
#               ignored). Relative to the start of the DPRAM.
.equ	USB_DEVICE_DPRAM_EP15_OUT_CONTROL_BUFFER_ADDRESS_RESET, 0x0000
.equ	USB_DEVICE_DPRAM_EP15_OUT_CONTROL_BUFFER_ADDRESS_BITS, 0x0000ffff
.equ	USB_DEVICE_DPRAM_EP15_OUT_CONTROL_BUFFER_ADDRESS_MSB, 15
.equ	USB_DEVICE_DPRAM_EP15_OUT_CONTROL_BUFFER_ADDRESS_LSB, 0
# =============================================================================
# Register    : USB_DEVICE_DPRAM_EP0_IN_BUFFER_CONTROL
# Description : Buffer control for both buffers of an endpoint. Fields ending
#               in a _1 are for buffer 1.
#               Fields ending in a _0 are for buffer 0. Buffer 1 controls are
#               only valid if the endpoint is in double buffered mode.
.equ	USB_DEVICE_DPRAM_EP0_IN_BUFFER_CONTROL_OFFSET, 0x00000080
.equ	USB_DEVICE_DPRAM_EP0_IN_BUFFER_CONTROL_BITS, 0xffffffff
.equ	USB_DEVICE_DPRAM_EP0_IN_BUFFER_CONTROL_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP0_IN_BUFFER_CONTROL_FULL_1
# Description : Buffer 1 is full. For an IN transfer (TX to the host) the bit
