konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/usb_device_dpram.inc
# Field       : USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_FULL_1
# Description : Buffer 1 is full. For an IN transfer (TX to the host) the bit
#               is set to indicate the data is valid. For an OUT transfer (RX
#               from the host) this bit should be left as a 0. The host will
#               set it when it has filled the buffer with data.
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_FULL_1_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_FULL_1_BITS, 0x80000000
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_FULL_1_MSB, 31
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_FULL_1_LSB, 31
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_LAST_1
# Description : Buffer 1 is the last buffer of the transfer.
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_LAST_1_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_LAST_1_BITS, 0x40000000
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_LAST_1_MSB, 30
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_LAST_1_LSB, 30
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_PID_1
# Description : The data pid of buffer 1.
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_PID_1_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_PID_1_BITS, 0x20000000
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_PID_1_MSB, 29
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_PID_1_LSB, 29
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET
# Description : The number of bytes buffer 1 is offset from buffer 0 in
#               Isochronous mode. Only valid in double buffered mode for an
#               Isochronous endpoint.
#               For a non Isochronous endpoint the offset is always 64 bytes.
#               0x0 -> 128
#               0x1 -> 256
#               0x2 -> 512
#               0x3 -> 1024
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_BITS, 0x18000000
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_MSB, 28
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_LSB, 27
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_VALUE_128, 0x0
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_VALUE_256, 0x1
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_VALUE_512, 0x2
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_VALUE_1024, 0x3
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_AVAILABLE_1
# Description : Buffer 1 is available. This bit is set to indicate the buffer
#               can be used by the controller. The controller clears the
#               available bit when writing the status back.
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_AVAILABLE_1_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_AVAILABLE_1_BITS, 0x04000000
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_AVAILABLE_1_MSB, 26
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_AVAILABLE_1_LSB, 26
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_LENGTH_1
# Description : The length of the data in buffer 1.
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_LENGTH_1_RESET, 0x000
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_LENGTH_1_BITS, 0x03ff0000
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_LENGTH_1_MSB, 25
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_LENGTH_1_LSB, 16
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_FULL_0
# Description : Buffer 0 is full. For an IN transfer (TX to the host) the bit
#               is set to indicate the data is valid. For an OUT transfer (RX
#               from the host) this bit should be left as a 0. The host will
#               set it when it has filled the buffer with data.
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_FULL_0_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_FULL_0_BITS, 0x00008000
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_FULL_0_MSB, 15
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_FULL_0_LSB, 15
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_LAST_0
# Description : Buffer 0 is the last buffer of the transfer.
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_LAST_0_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_LAST_0_BITS, 0x00004000
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_LAST_0_MSB, 14
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_LAST_0_LSB, 14
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_PID_0
# Description : The data pid of buffer 0.
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_PID_0_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_PID_0_BITS, 0x00002000
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_PID_0_MSB, 13
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_PID_0_LSB, 13
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_RESET
# Description : Reset the buffer selector to buffer 0.
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_RESET_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_RESET_BITS, 0x00001000
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_RESET_MSB, 12
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_RESET_LSB, 12
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_STALL
# Description : Reply with a stall (valid for both buffers).
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_STALL_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_STALL_BITS, 0x00000800
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_STALL_MSB, 11
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_STALL_LSB, 11
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_AVAILABLE_0
# Description : Buffer 0 is available. This bit is set to indicate the buffer
#               can be used by the controller. The controller clears the
#               available bit when writing the status back.
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_AVAILABLE_0_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_AVAILABLE_0_BITS, 0x00000400
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_AVAILABLE_0_MSB, 10
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_AVAILABLE_0_LSB, 10
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_LENGTH_0
# Description : The length of the data in buffer 1.
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_LENGTH_0_RESET, 0x000
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_LENGTH_0_BITS, 0x000003ff
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_LENGTH_0_MSB, 9
.equ	USB_DEVICE_DPRAM_EP7_OUT_BUFFER_CONTROL_LENGTH_0_LSB, 0
# =============================================================================
# Register    : USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL
# Description : Buffer control for both buffers of an endpoint. Fields ending
#               in a _1 are for buffer 1.
#               Fields ending in a _0 are for buffer 0. Buffer 1 controls are
#               only valid if the endpoint is in double buffered mode.
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_OFFSET, 0x000000c0
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_BITS, 0xffffffff
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_FULL_1
# Description : Buffer 1 is full. For an IN transfer (TX to the host) the bit
#               is set to indicate the data is valid. For an OUT transfer (RX
#               from the host) this bit should be left as a 0. The host will
#               set it when it has filled the buffer with data.
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_FULL_1_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_FULL_1_BITS, 0x80000000
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_FULL_1_MSB, 31
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_FULL_1_LSB, 31
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_LAST_1
# Description : Buffer 1 is the last buffer of the transfer.
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_LAST_1_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_LAST_1_BITS, 0x40000000
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_LAST_1_MSB, 30
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_LAST_1_LSB, 30
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_PID_1
# Description : The data pid of buffer 1.
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_PID_1_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_PID_1_BITS, 0x20000000
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_PID_1_MSB, 29
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_PID_1_LSB, 29
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET
# Description : The number of bytes buffer 1 is offset from buffer 0 in
#               Isochronous mode. Only valid in double buffered mode for an
#               Isochronous endpoint.
#               For a non Isochronous endpoint the offset is always 64 bytes.
#               0x0 -> 128
#               0x1 -> 256
#               0x2 -> 512
#               0x3 -> 1024
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_BITS, 0x18000000
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_MSB, 28
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_LSB, 27
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_VALUE_128, 0x0
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_VALUE_256, 0x1
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_VALUE_512, 0x2
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_VALUE_1024, 0x3
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_AVAILABLE_1
# Description : Buffer 1 is available. This bit is set to indicate the buffer
#               can be used by the controller. The controller clears the
#               available bit when writing the status back.
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_AVAILABLE_1_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_AVAILABLE_1_BITS, 0x04000000
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_AVAILABLE_1_MSB, 26
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_AVAILABLE_1_LSB, 26
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_LENGTH_1
# Description : The length of the data in buffer 1.
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_LENGTH_1_RESET, 0x000
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_LENGTH_1_BITS, 0x03ff0000
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_LENGTH_1_MSB, 25
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_LENGTH_1_LSB, 16
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_FULL_0
# Description : Buffer 0 is full. For an IN transfer (TX to the host) the bit
#               is set to indicate the data is valid. For an OUT transfer (RX
#               from the host) this bit should be left as a 0. The host will
#               set it when it has filled the buffer with data.
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_FULL_0_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_FULL_0_BITS, 0x00008000
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_FULL_0_MSB, 15
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_FULL_0_LSB, 15
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_LAST_0
# Description : Buffer 0 is the last buffer of the transfer.
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_LAST_0_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_LAST_0_BITS, 0x00004000
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_LAST_0_MSB, 14
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_LAST_0_LSB, 14
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_PID_0
# Description : The data pid of buffer 0.
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_PID_0_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_PID_0_BITS, 0x00002000
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_PID_0_MSB, 13
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_PID_0_LSB, 13
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_RESET
# Description : Reset the buffer selector to buffer 0.
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_RESET_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_RESET_BITS, 0x00001000
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_RESET_MSB, 12
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_RESET_LSB, 12
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_STALL
# Description : Reply with a stall (valid for both buffers).
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_STALL_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_STALL_BITS, 0x00000800
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_STALL_MSB, 11
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_STALL_LSB, 11
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_AVAILABLE_0
# Description : Buffer 0 is available. This bit is set to indicate the buffer
#               can be used by the controller. The controller clears the
#               available bit when writing the status back.
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_AVAILABLE_0_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_AVAILABLE_0_BITS, 0x00000400
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_AVAILABLE_0_MSB, 10
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_AVAILABLE_0_LSB, 10
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_LENGTH_0
# Description : The length of the data in buffer 1.
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_LENGTH_0_RESET, 0x000
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_LENGTH_0_BITS, 0x000003ff
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_LENGTH_0_MSB, 9
.equ	USB_DEVICE_DPRAM_EP8_IN_BUFFER_CONTROL_LENGTH_0_LSB, 0
# =============================================================================
# Register    : USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL
# Description : Buffer control for both buffers of an endpoint. Fields ending
#               in a _1 are for buffer 1.
#               Fields ending in a _0 are for buffer 0. Buffer 1 controls are
#               only valid if the endpoint is in double buffered mode.
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_OFFSET, 0x000000c4
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_BITS, 0xffffffff
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_FULL_1
# Description : Buffer 1 is full. For an IN transfer (TX to the host) the bit
#               is set to indicate the data is valid. For an OUT transfer (RX
#               from the host) this bit should be left as a 0. The host will
#               set it when it has filled the buffer with data.
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_FULL_1_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_FULL_1_BITS, 0x80000000
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_FULL_1_MSB, 31
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_FULL_1_LSB, 31
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_LAST_1
# Description : Buffer 1 is the last buffer of the transfer.
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_LAST_1_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_LAST_1_BITS, 0x40000000
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_LAST_1_MSB, 30
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_LAST_1_LSB, 30
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_PID_1
# Description : The data pid of buffer 1.
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_PID_1_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_PID_1_BITS, 0x20000000
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_PID_1_MSB, 29
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_PID_1_LSB, 29
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET
# Description : The number of bytes buffer 1 is offset from buffer 0 in
#               Isochronous mode. Only valid in double buffered mode for an
#               Isochronous endpoint.
#               For a non Isochronous endpoint the offset is always 64 bytes.
#               0x0 -> 128
#               0x1 -> 256
#               0x2 -> 512
#               0x3 -> 1024
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_BITS, 0x18000000
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_MSB, 28
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_LSB, 27
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_VALUE_128, 0x0
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_VALUE_256, 0x1
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_VALUE_512, 0x2
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_DOUBLE_BUFFER_ISO_OFFSET_VALUE_1024, 0x3
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_AVAILABLE_1
# Description : Buffer 1 is available. This bit is set to indicate the buffer
#               can be used by the controller. The controller clears the
#               available bit when writing the status back.
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_AVAILABLE_1_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_AVAILABLE_1_BITS, 0x04000000
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_AVAILABLE_1_MSB, 26
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_AVAILABLE_1_LSB, 26
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_LENGTH_1
# Description : The length of the data in buffer 1.
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_LENGTH_1_RESET, 0x000
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_LENGTH_1_BITS, 0x03ff0000
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_LENGTH_1_MSB, 25
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_LENGTH_1_LSB, 16
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_FULL_0
# Description : Buffer 0 is full. For an IN transfer (TX to the host) the bit
#               is set to indicate the data is valid. For an OUT transfer (RX
#               from the host) this bit should be left as a 0. The host will
#               set it when it has filled the buffer with data.
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_FULL_0_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_FULL_0_BITS, 0x00008000
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_FULL_0_MSB, 15
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_FULL_0_LSB, 15
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_LAST_0
# Description : Buffer 0 is the last buffer of the transfer.
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_LAST_0_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_LAST_0_BITS, 0x00004000
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_LAST_0_MSB, 14
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_LAST_0_LSB, 14
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_PID_0
# Description : The data pid of buffer 0.
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_PID_0_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_PID_0_BITS, 0x00002000
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_PID_0_MSB, 13
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_PID_0_LSB, 13
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_RESET
# Description : Reset the buffer selector to buffer 0.
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_RESET_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_RESET_BITS, 0x00001000
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_RESET_MSB, 12
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_RESET_LSB, 12
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_STALL
# Description : Reply with a stall (valid for both buffers).
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_STALL_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_STALL_BITS, 0x00000800
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_STALL_MSB, 11
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_STALL_LSB, 11
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_AVAILABLE_0
# Description : Buffer 0 is available. This bit is set to indicate the buffer
#               can be used by the controller. The controller clears the
#               available bit when writing the status back.
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_AVAILABLE_0_RESET, 0x0
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_AVAILABLE_0_BITS, 0x00000400
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_AVAILABLE_0_MSB, 10
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_AVAILABLE_0_LSB, 10
# -----------------------------------------------------------------------------
# Field       : USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_LENGTH_0
# Description : The length of the data in buffer 1.
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_LENGTH_0_RESET, 0x000
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_LENGTH_0_BITS, 0x000003ff
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_LENGTH_0_MSB, 9
.equ	USB_DEVICE_DPRAM_EP8_OUT_BUFFER_CONTROL_LENGTH_0_LSB, 0
# =============================================================================
# Register    : USB_DEVICE_DPRAM_EP9_IN_BUFFER_CONTROL
# Description : Buffer control for both buffers of an endpoint. Fields ending
#               in a _1 are for buffer 1.
#               Fields ending in a _0 are for buffer 0. Buffer 1 controls are
#               only valid if the endpoint is in double buffered mode.
.equ	USB_DEVICE_DPRAM_EP9_IN_BUFFER_CONTROL_OFFSET, 0x000000c8
.equ	USB_DEVICE_DPRAM_EP9_IN_BUFFER_CONTROL_BITS, 0xffffffff
.equ	USB_DEVICE_DPRAM_EP9_IN_BUFFER_CONTROL_RESET, 0x00000000
